src/test/testtool/RaadpleegMetBurgerservicenummer/07/response.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Body><BG:npsLa01 xmlns:BG="http://www.egem.nl/StUF/sector/bg/0310" xmlns:StUF="http://www.egem.nl/StUF/StUF0301" xmlns:gml="http://www.opengis.net/gml" xmlns:ns="http://www.egem.nl/StUF/sector/bg/0310" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xlink="http://www.w3.org/1999/xlink" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<BG:stuurgegevens>
		<StUF:berichtcode>La01</StUF:berichtcode>
		<StUF:zender>
			<organisatie xmlns="http://www.egem.nl/StUF/StUF0301">test1</organisatie>
			<applicatie xmlns="http://www.egem.nl/StUF/StUF0301">test</applicatie>
		</StUF:zender>
		<StUF:ontvanger>
			<organisatie xmlns="http://www.egem.nl/StUF/StUF0301">0518</organisatie>
			<applicatie xmlns="http://www.egem.nl/StUF/StUF0301">LBA</applicatie>
		</StUF:ontvanger>
		<StUF:tijdstipBericht>20241014193057291</StUF:tijdstipBericht>
		<StUF:crossRefnummer>3f8aed9f-307d-4bca-8081-aaabaa9202df</StUF:crossRefnummer>
		<StUF:entiteittype>NPS</StUF:entiteittype>
	</BG:stuurgegevens>
	<BG:parameters>
		<StUF:indicatorVervolgvraag>false</StUF:indicatorVervolgvraag>
		<StUF:indicatorAfnemerIndicatie>false</StUF:indicatorAfnemerIndicatie>
		<StUF:aantalVoorkomens>1</StUF:aantalVoorkomens>
	</BG:parameters>
	<BG:antwoord>
		<BG:object StUF:entiteittype="NPS">
			<inp.bsn xmlns="http://www.egem.nl/StUF/sector/bg/0310">999993628</inp.bsn>
			<inp.a-nummer xmlns="http://www.egem.nl/StUF/sector/bg/0310">3461805105</inp.a-nummer>
			<geslachtsnaam xmlns="http://www.egem.nl/StUF/sector/bg/0310">Huijgen</geslachtsnaam>
			<voorvoegselGeslachtsnaam xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<voorletters xmlns="http://www.egem.nl/StUF/sector/bg/0310">G.</voorletters>
			<voornamen xmlns="http://www.egem.nl/StUF/sector/bg/0310">Geertje</voornamen>
			<aanduidingNaamgebruik xmlns="http://www.egem.nl/StUF/sector/bg/0310">V</aanduidingNaamgebruik>
			<geslachtsnaamPartner xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<geslachtsaanduiding xmlns="http://www.egem.nl/StUF/sector/bg/0310">V</geslachtsaanduiding>
			<geboortedatum xmlns="http://www.egem.nl/StUF/sector/bg/0310">19010613</geboortedatum>
			<inp.geboorteplaats xmlns="http://www.egem.nl/StUF/sector/bg/0310">Huisseling en Neerloon</inp.geboorteplaats>
			<inp.geboorteLand xmlns="http://www.egem.nl/StUF/sector/bg/0310">6030</inp.geboorteLand>
			<overlijdensdatum xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<inp.overlijdenplaats xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<inp.overlijdenLand xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<verblijfsadres xmlns="http://www.egem.nl/StUF/sector/bg/0310">
				<aoa.identificatie xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
				<wpl.identificatie xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
				<wpl.woonplaatsNaam>'s-Gravenhage</wpl.woonplaatsNaam>
				<aoa.woonplaatsWaarinGelegen>
					<wpl.identificatie xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
					<wpl.woonplaatsNaam xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
				</aoa.woonplaatsWaarinGelegen>
				<gor.identificatie xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
				<opr.identificatie xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
				<gor.openbareRuimteNaam xsi:nil="true" StUF:noValue="waardeOnbekend"/>
				<gor.straatnaam>Nieuwe Parklaan</gor.straatnaam>
				<aoa.postcode>2597LD</aoa.postcode>
				<aoa.huisnummer>58</aoa.huisnummer>
				<aoa.huisletter xsi:nil="true" StUF:noValue="waardeOnbekend"/>
				<aoa.huisnummertoevoeging xsi:nil="true" StUF:noValue="waardeOnbekend"/>
				<inp.locatiebeschrijving xsi:nil="true" StUF:noValue="waardeOnbekend"/>
				<begindatumVerblijf>20040404</begindatumVerblijf>
			</verblijfsadres>
			<inp.adresHerkomst xmlns="http://www.egem.nl/StUF/sector/bg/0310">W</inp.adresHerkomst>
			<inp.burgerlijkeStaat xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<inp.gemeenteVanInschrijving xmlns="http://www.egem.nl/StUF/sector/bg/0310">0518</inp.gemeenteVanInschrijving>
			<inp.datumInschrijving xmlns="http://www.egem.nl/StUF/sector/bg/0310">19940930</inp.datumInschrijving>
			<inp.indicatieGeheim xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<inp.heeftAlsNationaliteit StUF:entiteittype="NPSNAT" xmlns="http://www.egem.nl/StUF/sector/bg/0310">
				<gerelateerde StUF:entiteittype="NAT">
					<code>0001</code>
					<omschrijving>Nederlandse</omschrijving>
				</gerelateerde>
				<inp.redenVerkrijging>001</inp.redenVerkrijging>
				<inp.datumVerkrijging>19010613</inp.datumVerkrijging>
			</inp.heeftAlsNationaliteit>
			<inp.heeftAlsEchtgenootPartner StUF:entiteittype="NPSNPSHUW" xmlns="http://www.egem.nl/StUF/sector/bg/0310">
				<gerelateerde StUF:entiteittype="NPS">
					<inp.bsn xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
					<geslachtsnaam>Kierkegaard</geslachtsnaam>
					<voorvoegselGeslachtsnaam xsi:nil="true" StUF:noValue="waardeOnbekend"/>
					<voorletters>C.E.C.</voorletters>
					<voornamen>Carolus Engelbertus Christianus</voornamen>
					<geslachtsnaamPartner xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
					<voorvoegselGeslachtsnaamPartner xsi:nil="true" StUF:noValue="waardeOnbekend"/>
					<geslachtsaanduiding xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
					<geboortedatum>19000630</geboortedatum>
					<inp.burgerlijkeStaat xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
				</gerelateerde>
				<soortVerbintenis xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			</inp.heeftAlsEchtgenootPartner>
			<inp.heeftAlsOuders StUF:entiteittype="NPSNPSOUD" xmlns="http://www.egem.nl/StUF/sector/bg/0310">
				<gerelateerde StUF:entiteittype="NPS">
					<geslachtsnaam>Jansen</geslachtsnaam>
					<voorvoegselGeslachtsnaam xsi:nil="true" StUF:noValue="waardeOnbekend"/>
					<voorletters>G.</voorletters>
					<voornamen>Gertruda</voornamen>
					<geslachtsaanduiding>V</geslachtsaanduiding>
					<geboortedatum>18780221</geboortedatum>
					<inp.indicatieGeheim xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
				</gerelateerde>
			</inp.heeftAlsOuders>
			<inp.heeftAlsOuders StUF:entiteittype="NPSNPSOUD" xmlns="http://www.egem.nl/StUF/sector/bg/0310">
				<gerelateerde StUF:entiteittype="NPS">
					<geslachtsnaam>Huijgen</geslachtsnaam>
					<voorvoegselGeslachtsnaam xsi:nil="true" StUF:noValue="waardeOnbekend"/>
					<voorletters>J.J.</voorletters>
					<voornamen>Jaap Jan</voornamen>
					<geslachtsaanduiding>M</geslachtsaanduiding>
					<geboortedatum>18740824</geboortedatum>
					<inp.indicatieGeheim xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
				</gerelateerde>
			</inp.heeftAlsOuders>
		</BG:object>
	</BG:antwoord>
</BG:npsLa01></soapenv:Body></soapenv:Envelope>